[NoCoverage] ArrowFunction
src/index.ts:4:18
 import { app } from "./server/app";
 
 const PORT = 3000;
-app.listen(PORT, () => console.log(`Node.js is listening to PORT : ${PORT}`));
+app.listen(PORT, () => undefined);
 

[NoCoverage] StringLiteral
src/index.ts:4:36
 import { app } from "./server/app";
 
 const PORT = 3000;
-app.listen(PORT, () => console.log(`Node.js is listening to PORT : ${PORT}`));
+app.listen(PORT, () => console.log(``));
 
