[Timeout] BlockStatement
src/server/app.ts:9:72
   name: string;
 };
 
-app.get("/hello", (req: Request<{}, {}, HelloQuery>, res: Response) => {
-  const { name } = req.query;
-
-  if (!name) {
-    res.status(400).json({ msg: "Bad Request." });
-    return;
-  }
-
-  res.send(`Hello ${name}!`);
-});
+app.get("/hello", (req: Request<{}, {}, HelloQuery>, res: Response) => {});
 
 export default app;

[Killed] StringLiteral
src/server/app.ts:9:9
   name: string;
 };
 
-app.get("/hello", (req: Request<{}, {}, HelloQuery>, res: Response) => {
+app.get("", (req: Request<{}, {}, HelloQuery>, res: Response) => {
   const { name } = req.query;
 
killedBy: API Test Hello API 正常系
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/server/app.ts:12:14
 app.get("/hello", (req: Request<{}, {}, HelloQuery>, res: Response) => {
   const { name } = req.query;
 
-  if (!name) {
-    res.status(400).json({ msg: "Bad Request." });
-    return;
-  }
+  if (!name) {}
 
   res.send(`Hello ${name}!`);
killedBy: API Test Hello API 異常系 (Queryなし)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
src/server/app.ts:12:7
 app.get("/hello", (req: Request<{}, {}, HelloQuery>, res: Response) => {
   const { name } = req.query;
 
-  if (!name) {
+  if (name) {
     res.status(400).json({ msg: "Bad Request." });
     return;
killedBy: API Test Hello API 正常系
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400
